In [4]:
"""
Create table Items(
	id int,
	order_id int,
	product_id int,
	quantity int,
	total_price money
)
"""

'\nCreate table Items(\n\tid int,\n\torder_id int,\n\tproduct_id int,\n\tquantity int,\n\ttotal_price money\n)\n'

In [5]:

import pandas as pd
import pyodbc 

server = 'DESKTOP-505F0PE'
database = 'Python' 
conexaoDB = pyodbc.connect('DRIVER={ODBC Driver 17 for SQL Server};'
                      f'SERVER={server};'
                      f'DATABASE={database};'
                      'Trusted_Connection=yes;')

cursor = conexaoDB.cursor()

In [6]:
dados = pd.read_excel(r"D:\engenharia de dados\curso udemy\Arquivos\04.+ETL+Pandas\04. ETL Pandas\arquivos_excel\Items.xlsx")
str(dados.columns).replace("'","")

'Index([id, order_id, product_id, quantity, total_price], dtype=object)'

In [7]:
cursor.execute('delete from [Items]') 
cursor.commit()

In [10]:
dados.head(5)

   id  order_id  product_id  quantity  total_price
0   0      7019          28         1          186
1   1      8827          29         1          110
2   2      3863          38         1          385
3   3      5002          37         1          493
4   4      6337          28         1          186

In [15]:

print(dados['total_price'].dtype)

float64

In [14]:
dados['total_price'] = dados['total_price'].astype(float)

In [16]:
for index, linha in dados.iterrows():
    
    cursor.execute("Insert into [Items](id, order_id, product_id, quantity, total_price)values(?,?,?,?,?)",linha.id,linha.order_id,linha.product_id,linha.quantity, linha.total_price) 
    
cursor.commit()   
cursor.close()
conexaoDB.close()